Feature: Запись на прием

Background:
Given пользователь находится на главной странице сайта

Scenario: Пользователь отправляет заявку на консультацию
When пользователь открывает форму записи на консультацию
And пользователь заполняет имя "Василина"
And пользователь заполняет номер телефона "+375291234567"
And пользователь указывает причину обращения "Лечение кариеса"
And пользователь соглашается на обработку персональных данных
And пользователь отправляет заявку
Then пользователь видит сообщение об успешной отправке заявки

Scenario: Пользователь выбирает врача для записи
Given пользователь открыл профиль врача Кедык Полина Викторовна
When пользователь открывает форму записи на прием
And пользователь выбирает врача Кедык Полина Викторовна, Стоматолог-ортодонт
Then пользователь видит выбранного врача в форме записи
