Feature: Просмотр цен

Background:
Given пользователь находится на главной странице сайта
And пользователь открывает раздел цен

Scenario Outline: Просмотр стоимости лечения кариеса в выбранной валюте
Given пользователь видит услугу Лечение кариеса
When пользователь выбирает валюту "<currency>"
Then пользователь видит выбранную валюту "<currency>"
And пользователь видит цену лечения кариеса "<price>"


Examples:
  | currency | price         |
  | BYN      | От 250 до 350 |
  | EUR      | От 73 до 102  |

